       >>SOURCE FORMAT FREE
       01  MAVULA-REGULATORY-EXPORT-RECORD.
           05 MAVULA-RAW-RECORD                 PIC X(2048).
           05 MAVULA-HEADER REDEFINES MAVULA-RAW-RECORD.
              10 MAVULA-H-RECORD-TYPE           PIC X.
              10 MAVULA-H-LAYOUT-ID             PIC X(32).
              10 MAVULA-H-LAYOUT-VERSION        PIC 9(3).
              10 MAVULA-H-EXPORT-ID             PIC X(64).
              10 MAVULA-H-TENANT-ID             PIC X(64).
              10 MAVULA-H-INSTITUTION-ID        PIC X(64).
              10 MAVULA-H-PERIOD-FROM           PIC 9(8).
              10 MAVULA-H-PERIOD-TO             PIC 9(8).
              10 MAVULA-H-GENERATED-AT          PIC X(20).
              10 MAVULA-H-RESERVED              PIC X(1784).
           05 MAVULA-DETAIL REDEFINES MAVULA-RAW-RECORD.
              10 MAVULA-D-RECORD-TYPE           PIC X.
              10 MAVULA-D-RECORD-ID             PIC X(64).
              10 MAVULA-D-TRANSACTION-ID        PIC X(64).
              10 MAVULA-D-TRANSACTION-TYPE      PIC X(32).
              10 MAVULA-D-INSTRUCTION-METHOD    PIC X(8).
              10 MAVULA-D-SOURCE-PARTY-ID       PIC X(64).
              10 MAVULA-D-SOURCE-ACCOUNT-ID     PIC X(64).
              10 MAVULA-D-DEST-PARTY-ID         PIC X(64).
              10 MAVULA-D-DEST-ACCOUNT-ID       PIC X(64).
              10 MAVULA-D-COUNTERPARTY-ID       PIC X(64).
              10 MAVULA-D-AMOUNT                 PIC 9(16)V99.
              10 MAVULA-D-CURRENCY               PIC X(3).
              10 MAVULA-D-OCCURRED-AT            PIC X(20).
              10 MAVULA-D-RECORDED-AT            PIC X(20).
              10 MAVULA-D-CORRELATION-ID         PIC X(64).
              10 MAVULA-D-RETENTION-UNTIL        PIC 9(8).
              10 MAVULA-D-LEGAL-BASIS-CODE       PIC X(64).
              10 MAVULA-D-ADJUSTMENT-TYPE        PIC X(10).
              10 MAVULA-D-ORIGINAL-TXN-ID        PIC X(64).
              10 MAVULA-D-REVERSAL-TXN-ID        PIC X(64).
              10 MAVULA-D-REPLACEMENT-TXN-ID     PIC X(64).
              10 MAVULA-D-RESERVED               PIC X(1160).
           05 MAVULA-TRAILER REDEFINES MAVULA-RAW-RECORD.
              10 MAVULA-T-RECORD-TYPE           PIC X.
              10 MAVULA-T-RECORD-COUNT          PIC 9(10).
              10 MAVULA-T-TOTAL-AMOUNT          PIC 9(18)V99.
              10 MAVULA-T-CONTENT-SHA256        PIC X(64).
              10 MAVULA-T-EXPORT-ID             PIC X(64).
              10 MAVULA-T-RESERVED              PIC X(1889).
